weeks/1st_week/general_notes.org
* MAPRO Full Analysis Test Run

Command executed:

#+begin_src bash
bash ../scripts/driver.sh \
    -n ../data/neidb \
    < ../data/test_list.txt
#+end_src

The driver script processes each organism listed in =test_list.txt= independently.

** 1. Aquifex aeolicus VF5 (aae)

Output:

#+begin_example
Analyzing aae Aquifex aeolicus VF5
Collecting 1 genome record
Downloading: tdata.zip
...
Error: There are no genome assemblies that match your query.
#+end_example

The type strain was found in the Neighbors database. Only one target genome accession was available. NCBI Datasets attempted to download the genome. No complete/chromosome-level assembly was available. As a result, no genome FASTA file was downloaded.

#+begin_example
ls: cannot access 'aae/targets/'
ls: cannot access 'aae/neighbors'
#+end_example

Since no genomes were available, MAPRO could not build a phylogeny and therefore skipped marker discovery for this species.

** 2. Agrobacterium fabrum C58 (afa)

Output:

#+begin_example
Collecting 20 genome records
Collecting 68 genome records
#+end_example

20 genomes were identified as target genomes. 68 genomes were identified as neighboring genomes.

The genomes were downloaded and rehydrated successfully.

A phylogeny was constructed and a representative target genome was selected:

#+begin_example
using tGCF_003667945.1_ASM366794v1_genomic.fna as target representative
#+end_example

Marker discovery (Fur):

#+begin_example
Step             Sequences   Length      Ns
Subtraction_1        5305    1487141      0
Intersection         2188     469635  18938
Subtraction_2          55      39423  26398
#+end_example

Interpretation:

Subtraction_1: sequences present in target genomes but absent from neighbors.
Intersection: sequences shared among all target genomes.
Subtraction_2: final candidate marker regions.

** General Workflow

For each organism, MAPRO performs:

Identify target and neighboring taxa using the Neighbors database.
Download genomes from NCBI.
Build a phylogeny.
Select a representative target genome.
Create a Fur database.
Run Fur marker discovery.
Produce marker sequences.
Design primers from the discovered markers.
