weeks/1st_week/general_notes.tex
% Created 2026-06-19 Fri 15:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Elif Güler}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Elif Güler},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.36)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{MAPRO Full Analysis Test Run}
\label{sec:orga653e3c}

Command executed:

\begin{verbatim}
bash ../scripts/driver.sh \
    -n ../data/neidb \
    < ../data/test_list.txt
\end{verbatim}

The driver script processes each organism listed in \texttt{test\_list.txt} independently.
\subsection{1. Aquifex aeolicus VF5 (aae)}
\label{sec:orgc51af88}

Output:

\begin{verbatim}
Analyzing aae Aquifex aeolicus VF5
Collecting 1 genome record
Downloading: tdata.zip
...
Error: There are no genome assemblies that match your query.
\end{verbatim}

The type strain was found in the Neighbors database. Only one target genome accession was available. NCBI Datasets attempted to download the genome. No complete/chromosome-level assembly was available. As a result, no genome FASTA file was downloaded.

\begin{verbatim}
ls: cannot access 'aae/targets/'
ls: cannot access 'aae/neighbors'
\end{verbatim}

Since no genomes were available, MAPRO could not build a phylogeny and therefore skipped marker discovery for this species.
\subsection{2. Agrobacterium fabrum C58 (afa)}
\label{sec:org33403f5}

Output:

\begin{verbatim}
Collecting 20 genome records
Collecting 68 genome records
\end{verbatim}

20 genomes were identified as target genomes. 68 genomes were identified as neighboring genomes.

The genomes were downloaded and rehydrated successfully.

A phylogeny was constructed and a representative target genome was selected:

\begin{verbatim}
using tGCF_003667945.1_ASM366794v1_genomic.fna as target representative
\end{verbatim}

Marker discovery (Fur):

\begin{verbatim}
Step             Sequences   Length      Ns
Subtraction_1        5305    1487141      0
Intersection         2188     469635  18938
Subtraction_2          55      39423  26398
\end{verbatim}

Interpretation:

Subtraction\textsubscript{1}: sequences present in target genomes but absent from neighbors.
Intersection: sequences shared among all target genomes.
Subtraction\textsubscript{2}: final candidate marker regions.
\subsection{General Workflow}
\label{sec:org7202cba}

For each organism, MAPRO performs:

Identify target and neighboring taxa using the Neighbors database.
Download genomes from NCBI.
Build a phylogeny.
Select a representative target genome.
Create a Fur database.
Run Fur marker discovery.
Produce marker sequences.
Design primers from the discovered markers.
\end{document}
